In [1]:
import pandas as pd
from scipy import stats

In [2]:
# Read the Titanic dataset into a DataFrame
df = pd.read_csv("titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df["Age"].fillna(df["Age"].mean(), inplace=True)
df["Embarked"].fillna(method="ffill", inplace=True)
df["Cabin"].fillna(method="ffill", inplace=True)

In [7]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Gender         0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          1
Embarked       0
dtype: int64

In [8]:
df=df.dropna()

In [9]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Gender         0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Hypothesis Testing on the Titanic Dataset:
We will test whether there is a significant difference between the proportions of survived females and survived males.

In [10]:
# Filter the dataset for survived females and survived males
survived_females = df[df["Gender"] == "female"]["Survived"]
survived_males = df[df["Gender"] == "male"]["Survived"]

In [11]:
print("survived_females\n",survived_females)
print("survived_males\n",survived_males)

survived_females
 1      1
2      1
3      1
8      1
9      1
      ..
880    1
882    0
885    0
887    1
888    0
Name: Survived, Length: 314, dtype: int64
survived_males
 4      0
5      0
6      0
7      0
12     0
      ..
883    0
884    0
886    0
889    1
890    0
Name: Survived, Length: 576, dtype: int64

In [12]:
# Perform hypothesis testing using proportions_ztest
count_females = survived_females.sum()
count_males = survived_males.sum()
n_females = len(survived_females)
n_males = len(survived_males)

In [13]:
n_females

314

In [14]:
n_males

576

In [15]:
count = [count_females, count_males]
nobs = [n_females, n_males]

In [16]:
count

[233, 109]

In [17]:
nobs

[314, 576]

In [18]:
from statsmodels.stats.proportion import proportions_ztest
stat, p_value = proportions_ztest(count, nobs)

In [19]:
stat

16.20083598345689

In [20]:
p_value

4.974618241818731e-59

In [21]:
# Print the test statistic and p-value
print("Hypothesis Testing:")
print("Test Statistic:", stat)
print("p-value:", p_value)

Hypothesis Testing:
Test Statistic: 16.20083598345689
p-value: 4.974618241818731e-59

In [22]:
# Interpret the results
alpha = 0.05  # Level of significance

if p_value < alpha:
    print("Reject the null hypothesis. There is a significant difference between the proportions of survived females and survived males.")
else:
    print("Fail to reject the null hypothesis. There is no significant difference between the proportions of survived females and survived males.")

Reject the null hypothesis. There is a significant difference between the proportions of survived females and survived males.

ANOVA Testing on the Iris Dataset:
We will perform an ANOVA test to determine if there are significant differences in the mean values of the "species" variable.

In [23]:
import pandas as pd
import seaborn as sns
from scipy.stats import f_oneway

In [24]:

# Load the Iris dataset
df_iris= sns.load_dataset('iris')

In [25]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,C123,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,C123,Q

In [26]:
df.tail()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.00,C50,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.45,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.75,C148,Q

In [27]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Gender         0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [28]:
# Perform ANOVA testing using one-way ANOVA
groups = df_iris["species"].unique()
grouped_data = [df_iris[df_iris["species"] == group]["sepal_length"] for group in groups]

In [29]:
grouped_data

[0     5.1
 1     4.9
 2     4.7
 3     4.6
 4     5.0
 5     5.4
 6     4.6
 7     5.0
 8     4.4
 9     4.9
 10    5.4
 11    4.8
 12    4.8
 13    4.3
 14    5.8
 15    5.7
 16    5.4
 17    5.1
 18    5.7
 19    5.1
 20    5.4
 21    5.1
 22    4.6
 23    5.1
 24    4.8
 25    5.0
 26    5.0
 27    5.2
 28    5.2
 29    4.7
 30    4.8
 31    5.4
 32    5.2
 33    5.5
 34    4.9
 35    5.0
 36    5.5
 37    4.9
 38    4.4
 39    5.1
 40    5.0
 41    4.5
 42    4.4
 43    5.0
 44    5.1
 45    4.8
 46    5.1
 47    4.6
 48    5.3
 49    5.0
 Name: sepal_length, dtype: float64,
 50    7.0
 51    6.4
 52    6.9
 53    5.5
 54    6.5
 55    5.7
 56    6.3
 57    4.9
 58    6.6
 59    5.2
 60    5.0
 61    5.9
 62    6.0
 63    6.1
 64    5.6
 65    6.7
 66    5.6
 67    5.8
 68    6.2
 69    5.6
 70    5.9
 71    6.1
 72    6.3
 73    6.1
 74    6.4
 75    6.6
 76    6.8
 77    6.7
 78    6.0
 79    5.7
 80    5.5
 81    5.5
 82    5.8
 83    6.0
 84    5.4
 85    6.0
 86    6.7
 87    6.3
 88    5.6
 89    5.5
 90    5.5
 91    6.1
 92    5.8
 93    5.0
 94    5.6
 95    5.7
 96    5.7
 97    6.2
 98    5.1
 99    5.7
 Name: sepal_length, dtype: float64,
 100    6.3
 101    5.8
 102    7.1
 103    6.3
 104    6.5
 105    7.6
 106    4.9
 107    7.3
 108    6.7
 109    7.2
 110    6.5
 111    6.4
 112    6.8
 113    5.7
 114    5.8
 115    6.4
 116    6.5
 117    7.7
 118    7.7
 119    6.0
 120    6.9
 121    5.6
 122    7.7
 123    6.3
 124    6.7
 125    7.2
 126    6.2
 127    6.1
 128    6.4
 129    7.2
 130    7.4
 131    7.9
 132    6.4
 133    6.3
 134    6.1
 135    7.7
 136    6.3
 137    6.4
 138    6.0
 139    6.9
 140    6.7
 141    6.9
 142    5.8
 143    6.8
 144    6.7
 145    6.7
 146    6.3
 147    6.5
 148    6.2
 149    5.9
 Name: sepal_length, dtype: float64]

In [30]:
f_stat, p_value = f_oneway(*grouped_data)

In [31]:
f_stat

119.26450218450468

In [32]:
p_value

1.6696691907693826e-31

In [33]:
# Print the F-statistic and p-value
print("ANOVA Testing:")
print("F-statistic:", f_stat)
print("p-value:", p_value)

ANOVA Testing:
F-statistic: 119.26450218450468
p-value: 1.6696691907693826e-31

In [34]:
# Interpret the results
alpha = 0.05  # Level of significance

if p_value < alpha:
    print("Reject the null hypothesis. There are significant differences in the group means.")
else:
    print("Fail to reject the null hypothesis. There are no significant differences in the group means.")

Reject the null hypothesis. There are significant differences in the group means.